.データベース解答
Q1
CREATE TABLE departments (
    ->     department_id int unsigned NOT NULL PRIMARY KEY auto_increment,
    ->     name varchar(20) NOT NULL,
    ->     created_at timestamp DEFAULT CURRENT_TIMESTAMP,
    ->     updated_at timestamp DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    -> );

    mysql> DESC departments;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | NO   |     | NULL              |                                               |
| created_at    | timestamp    | NO   |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | NO   |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
4 rows in set (0.01 sec)


Q2
CREATE TABLE people (
    -> person_id INT(10) UNSIGNED NOT NULL PRIMARY KEY AUTO_INCREMENT,
    -> name VARCHAR(20) NOT NULL,
    -> email VARCHAR(255) UNIQUE,
    -> department_id INT(10) UNSIGNED,
    -> age TINYINT(3) UNSIGNED,
    -> gender TINYINT(4),
    -> created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    -> updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    -> );

・カラムの追加方法

    ALTER TABLE people
    -> ADD department_id INT UNSIGNED AFTER email;


    mysql> DESC people;
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type             | Null | Key | Default           | Extra                                         |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id     | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)      | NO   |     | NULL              |                                               |
| email         | varchar(255)     | YES  | UNI | NULL              |                                               |
| department_id | int unsigned     | YES  |     | NULL              |                                               |
| age           | tinyint unsigned | YES  |     | NULL              |                                               |
| gender        | tinyint          | YES  |     | NULL              |                                               |
| created_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
8 rows in set (0.02 sec)


Q3
INSERT INTO departments (name)
    -> VALUES
    -> ('営業'),
    -> ('開発'),
    -> ('経理'),
    -> ('人事'),
    -> ('情報システム');


SELECT * FROM departments;
+---------------+--------------------+---------------------+---------------------+
| department_id | name               | created_at          | updated_at          |
+---------------+--------------------+---------------------+---------------------+
|             1 | 営業               | 2025-03-21 15:30:55 | 2025-03-21 15:30:55 |
|             2 | 開発               | 2025-03-21 15:30:55 | 2025-03-21 15:30:55 |
|             3 | 経理               | 2025-03-21 15:30:55 | 2025-03-21 15:30:55 |
|             4 | 人事               | 2025-03-21 15:30:55 | 2025-03-21 15:30:55 |
|             5 | 情報システム       | 2025-03-21 15:30:55 | 2025-03-21 15:30:55 |
+---------------+--------------------+---------------------+---------------------+



Q３
INSERT INTO people (name)
    -> VALUES
    -> ('営業'),
    -> ('営業'),
    -> ('営業'),
    -> ('開発'),
    -> ('開発'),
    -> ('開発'),
    -> ('開発'),
    -> ('経理'),
    -> ('人事'),
    -> ('情報システム');



SELECT * FROM people;
+-----------+--------------------+-------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+-------+---------------+------+--------+---------------------+---------------------+
|         1 | 営業               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         2 | 営業               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         3 | 営業               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         4 | 開発               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         5 | 開発               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         6 | 開発               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         7 | 開発               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         8 | 経理               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|         9 | 人事               | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
|        10 | 情報システム       | NULL  |          NULL | NULL |   NULL | 2025-03-21 15:49:47 | 2025-03-21 15:49:47 |
+-----------+--------------------+-------+---------------+------+--------+---------------------+---------------------+



INSERT INTO reports (person_id, content, created_at)
    -> VALUES
    -> (1, '2025-03-21', '今日はデータベースの学習をした', '2025-03-27'),
    -> (2, '2025-03-21', 'クライアント対応のための資料を作成しました', '2025-03-27'),
    -> (3, '2025-03-25', '今後のプロジェクト計画をチームで話し合いました', '2025-03-27'),
    -> (4, '2025-03-25', 'マーケティング施策の分析結果を共有しました', '2025-03-27'),
    -> (5, '2025-03-25', '開発中の新機能のテストを実施しました', '2025-03-27'),
    -> (6, '2025-03-25', '財務報告書の作成とレビューを行いました', '2025-03-27'),
    -> (7, '2025-03-25', '社内研修の準備を進めました', '2025-03-27'),
    -> (8, '2025-03-25', '新しいシステム導入について提案をまとめました', '2025-03-27'),
    -> (9, '2025-03-25', '社内ネットワークのメンテナンスを行いました', '2025-03-27'),
    -> (10, '2025-03-25', '人事評価制度の見直しについて議論しました', '2025-03-27');
Query OK, 10 rows affected (0.00 sec)


SELECT * FROM reports;
+-----------+-----------+-------------+-----------------------------------------------------------------------+---------------------+
| report_id | person_id | report_date | content                                                               | created_at          |
+-----------+-----------+-------------+-----------------------------------------------------------------------+---------------------+
|         1 |         1 | 2025-03-21  | 今日はデータベースの学習をした                                        | 2025-03-27 00:00:00 |
|         2 |         2 | 2025-03-21  | クライアント対応のための資料を作成しました                            | 2025-03-27 00:00:00 |
|         3 |         3 | 2025-03-25  | 今後のプロジェクト計画をチームで話し合いました                        | 2025-03-27 00:00:00 |
|         4 |         4 | 2025-03-25  | マーケティング施策の分析結果を共有しました                            | 2025-03-27 00:00:00 |
|         5 |         5 | 2025-03-25  | 開発中の新機能のテストを実施しました                                  | 2025-03-27 00:00:00 |
|         6 |         6 | 2025-03-25  | 財務報告書の作成とレビューを行いました                                | 2025-03-27 00:00:00 |
|         7 |         7 | 2025-03-25  | 社内研修の準備を進めました                                            | 2025-03-27 00:00:00 |
|         8 |         8 | 2025-03-25  | 新しいシステム導入について提案をまとめました                          | 2025-03-27 00:00:00 |
|         9 |         9 | 2025-03-25  | 社内ネットワークのメンテナンスを行いました                            | 2025-03-27 00:00:00 |
|        10 |        10 | 2025-03-25  | 人事評価制度の見直しについて議論しました                              | 2025-03-27 00:00:00 |
+-----------+-----------+-------------+-----------------------------------------------------------------------+---------------------+
10 rows in set (0.00 sec)



Q4
SELECT * FROM people;
+-----------+--------------------+------------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                        | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+------------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし         | suzuki@gizumo.jp             |             1 |   20 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:17:58 |
|         2 | 田中ゆうこ         | tanaka@beyond-works.co.jp    |             1 |   25 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:18:31 |
|         3 | 福田だいすけ       | fukuda@beyond-works.co.jp    |             1 |   42 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:18:45 |
|         4 | 豊島はなこ         | toyoshima@beyond-works.co.jp |             2 |   34 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:18:53 |
|         5 | 早坂てつお         | hayasaka@beyond-works.co.jp  |             2 |   61 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:19:51 |
|         6 | 小川　香織         | ogawa@gizumo.jp              |             2 |   72 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:20:00 |
|         7 | 坂田詩織           | sakata@gizumo.jp             |             2 |   45 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:20:08 |
|         8 | 今村　正           | imamura@gizumo.jp            |             3 |   38 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:20:15 |
|         9 | 岩田 涼            | iwata@gizumo.jp              |             4 |   27 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:20:23 |
|        10 | 長岡　唯           | nagaokayui.jp                |             5 |   25 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:20:35 |
+-----------+--------------------+------------------------------+---------------+------+--------+---------------------+---------------------+
10 rows in set (0.01 sec)


・存在する部署のIDが割り振り。WHEREを使った条件付きで指定。

UPDATE people
    -> SET department_id = 1
    -> WHERE person_id = 1;

UPDATE people
    -> SET department_id = 2
    -> WHERE person_id = 4;

UPDATE people
    -> SET department_id = 3
    -> WHERE person_id = 8;

UPDATE people
    -> SET department_id = 4
    -> WHERE person_id = 9;

UPDATE people
    -> SET department_id = 5
    -> WHERE person_id = 10;

Q5
SELECT name,age
    -> FROM people
    -> WHERE gender = 1
    -> ORDER BY age ASC;
+--------------------+------+
| name               | age  |
+--------------------+------+
| 鈴木たかし         |   20 |
| 岩田 涼            |   27 |
| 今村　正           |   38 |
| 福田だいすけ       |   42 |
| 早坂てつお         |   61 |
+--------------------+------+
5 rows in set (0.01 sec)


Q6
SELECT name,email,age
    -> FROM people
    -> WHERE department_id = 1
    -> ORDER BY created_at;
+--------------------+---------------------------+------+
| name               | email                     | age  |
+--------------------+---------------------------+------+
| 鈴木たかし         | suzuki@gizumo.jp          |   20 |
| 田中ゆうこ         | tanaka@beyond-works.co.jp |   25 |
| 福田だいすけ       | fukuda@beyond-works.co.jp |   42 |
+--------------------+---------------------------+------+
3 rows in set (0.00 sec)


説明として、people テーブル から department_id が 1 のレコード を取得し、name、email、age のカラムのみを表示。
created_at カラムの昇順 に並べる。



Q7
SELECT name,age,gender
    -> FROM people
    -> WHERE gender = 2 AND age BETWEEN 20 AND 29
    -> or gender = 1 AND age BETWEEN 40 AND 49;
+--------------------+------+--------+
| name               | age  | gender |
+--------------------+------+--------+
| 田中ゆうこ         |   25 |      2 |
| 福田だいすけ       |   42 |      1 |
| 長岡　唯           |   25 |      2 |
+--------------------+------+--------+
3 rows in set (0.01 sec)



Q8
SELECT *
    -> FROM people
    -> WHERE department_id = 1
    -> ORDER BY age ASC;
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                     | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし         | suzuki@gizumo.jp          |             1 |   20 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:17:58 |
|         2 | 田中ゆうこ         | tanaka@beyond-works.co.jp |             1 |   25 |      2 | 2025-03-21 17:32:45 | 2025-03-27 13:18:31 |
|         3 | 福田だいすけ       | fukuda@beyond-works.co.jp |             1 |   42 |      1 | 2025-03-21 17:32:45 | 2025-03-27 13:18:45 |
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
3 rows in set (0.00 sec)



Q9
SELECT AVG(age) AS average_age
    -> FROM people
    -> WHERE department_id = 2
    -> and gender = 2;
+-------------+
| average_age |
+-------------+
|     50.3333 |
+-------------+
1 row in set (0.00 sec)



Q10
SELECT p.person_id, p.name, d.name AS department_name, r.content
    -> FROM people p LEFT OUTER JOIN reports r USING (person_id)
    -> LEFT OUTER JOIN departments d ON p.department_id = d.department_id;
+-----------+--------------------+--------------------+-----------------------------------------------------------------------+
| person_id | name               | department_name    | content                                                               |
+-----------+--------------------+--------------------+-----------------------------------------------------------------------+
|         1 | 鈴木たかし         | 営業               | 今日はデータベースの学習をした                                        |
|         2 | 田中ゆうこ         | 営業               | クライアント対応のための資料を作成しました                            |
|         3 | 福田だいすけ       | 営業               | 今後のプロジェクト計画をチームで話し合いました                        |
|         4 | 豊島はなこ         | 開発               | マーケティング施策の分析結果を共有しました                            |
|         5 | 早坂てつお         | 開発               | 開発中の新機能のテストを実施しました                                  |
|         6 | 小川　香織         | 開発               | 財務報告書の作成とレビューを行いました                                |
|         7 | 坂田詩織           | 開発               | 社内研修の準備を進めました                                            |
|         8 | 今村　正           | 経理               | 新しいシステム導入について提案をまとめました                          |
|         9 | 岩田 涼            | 人事               | 社内ネットワークのメンテナンスを行いました                            |
|        10 | 長岡　唯           | 情報システム       | 人事評価制度の見直しについて議論しました                              |
+-----------+--------------------+--------------------+-----------------------------------------------------------------------+
10 rows in set (0.00 sec)



Q11
SELECT p.name
    -> FROM people p
    -> LEFT JOIN reports r ON p.person_id = r.person_id
    -> WHERE r.person_id IS NULL OR r.content IS NULL;
+-----------------+
| name            |
+-----------------+
| 中山　卓弥      |
+-----------------+
1 row in set (0.00 sec)